clusterMHDTest/Cilindro/MHD/TVDLF-1/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    rho
    {
        solver          diagonal;
    }


    pB
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-10;
        relTol          0;
    }


    rhoUx
    {
        solver          diagonal;
    }

    rhoUy
    {
        solver          diagonal;
    }

    rhoUz
    {
        solver          diagonal;
    }

    Bx
    {
        solver          diagonal;
    }

    By
    {
        solver          diagonal;
    }
    Bz
    {
        solver          diagonal;
    }


    rhoE
    {
        solver          diagonal;
    }



}

residual
 {

 maxResidualRho  1;
 maxResidualU  1;
 maxResidualEt  1;

 }






  






// ************************************************************************* //
